## Plan Result (sandbox_enterprise)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 0 to change, 5 to destroy.</code></pre>

* Create
  * module.custom_role_assignments[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.custom_role_assignments[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
* Delete
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_custom_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.custom_role_assignments["DTS-RBAC-NONPRODUCTION"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "87afe7e0-3995-416b-8175-74845cef3e97"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/06069648-d13b-4c3c-9367-f3a1ed8e38bc/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/06069648-d13b-4c3c-9367-f3a1ed8e38bc"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DTS-RBAC-SBOX"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4964f3aa-66f1-41dd-a1bf-2cc41a84ad6b"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/efd1f812-596d-4175-9e19-5b0577156ff9/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/efd1f812-596d-4175-9e19-5b0577156ff9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DTS-Terraform-Dev-Test3"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "79338c55-bfe2-497b-889c-bb023c4b7ab3"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/6d1e076a-5d02-4920-9fba-04063e28a488/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/6d1e076a-5d02-4920-9fba-04063e28a488"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DTS-Terraform-Dev-Test4"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cb74579c-1392-407b-ba2c-9efa9e184121"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/173a0e96-4482-4859-ac93-79e4abc83ab0/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/173a0e96-4482-4859-ac93-79e4abc83ab0"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.custom_role_assignments["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.custom_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "custom_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e8bfbd73-bf1c-4c89-9640-8ff165e2f789"
      + principal_type                   = (known after apply)
      + role_definition_id               = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026"
      + role_definition_name             = (known after apply)
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/06069648-d13b-4c3c-9367-f3a1ed8e38bc/providers/Microsoft.Authorization/roleAssignments/8732fba8-f0e8-1df2-9fe6-317514e2b8da" -> null
      - name                 = "8732fba8-f0e8-1df2-9fe6-317514e2b8da" -> null
      - principal_id         = "87afe7e0-3995-416b-8175-74845cef3e97" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/06069648-d13b-4c3c-9367-f3a1ed8e38bc/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/06069648-d13b-4c3c-9367-f3a1ed8e38bc" -> null
    }

  # module.subscription["DTS-RBAC-SBOX"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/efd1f812-596d-4175-9e19-5b0577156ff9/providers/Microsoft.Authorization/roleAssignments/d5a5c110-a681-b563-3de3-b3e41d01e725" -> null
      - name                 = "d5a5c110-a681-b563-3de3-b3e41d01e725" -> null
      - principal_id         = "4964f3aa-66f1-41dd-a1bf-2cc41a84ad6b" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/efd1f812-596d-4175-9e19-5b0577156ff9/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/efd1f812-596d-4175-9e19-5b0577156ff9" -> null
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/6d1e076a-5d02-4920-9fba-04063e28a488/providers/Microsoft.Authorization/roleAssignments/0f3631aa-2219-594f-0b84-af9bbad9a470" -> null
      - name                 = "0f3631aa-2219-594f-0b84-af9bbad9a470" -> null
      - principal_id         = "79338c55-bfe2-497b-889c-bb023c4b7ab3" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/6d1e076a-5d02-4920-9fba-04063e28a488/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/6d1e076a-5d02-4920-9fba-04063e28a488" -> null
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/173a0e96-4482-4859-ac93-79e4abc83ab0/providers/Microsoft.Authorization/roleAssignments/7028d9d9-8466-f61b-738a-d15373e30b61" -> null
      - name                 = "7028d9d9-8466-f61b-738a-d15373e30b61" -> null
      - principal_id         = "cb74579c-1392-407b-ba2c-9efa9e184121" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/173a0e96-4482-4859-ac93-79e4abc83ab0/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/173a0e96-4482-4859-ac93-79e4abc83ab0" -> null
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_custom_role_assignments["Application Gateway Backend Health Reader"] will be destroyed
  # (because azurerm_role_assignment.local_custom_role_assignments is not in configuration)
  - resource "azurerm_role_assignment" "local_custom_role_assignments" {
      - id                   = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3/providers/Microsoft.Authorization/roleAssignments/b8ee33b3-eed2-6a33-1a2f-b801d45fe1c1" -> null
      - name                 = "b8ee33b3-eed2-6a33-1a2f-b801d45fe1c1" -> null
      - principal_id         = "e8bfbd73-bf1c-4c89-9640-8ff165e2f789" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3/providers/Microsoft.Authorization/roleDefinitions/f49ac1b2-c2f8-894d-b4d5-ad1b0b5a7026" -> null
      - role_definition_name = "Application Gateway Backend Health Reader" -> null
      - scope                = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3" -> null
    }

Plan: 5 to add, 0 to change, 5 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":96,"Program":"tfcmt","SHA1":"","Target":"sandbox_enterprise","Vars":{}} -->